# Learning Together - Data Analysis

$e^{i\pi} + 1 = 0$

In [2]:
import pandas as pd
from io import StringIO

In [10]:
dataset = """\
Nomor Binatang Kecerdasan
1 Monyet Pintar
2 Anjing Pintar
3 Kucing Cuek
4 Merpati Pintar
5 Ikan Cuek
6 Gajah Santai"""

In [11]:
dframe = pd.read_csv(StringIO(dataset), sep='\s+')
dframe

   Nomor Binatang Kecerdasan
0      1   Monyet     Pintar
1      2   Anjing     Pintar
2      3   Kucing       Cuek
3      4  Merpati     Pintar
4      5     Ikan       Cuek
5      6    Gajah     Santai

In [15]:
pd.crosstab(dframe.Binatang,dframe.Kecerdasan,margins=True)

Kecerdasan  Cuek  Pintar  Santai  All
Binatang
Anjing         0       1       0    1
Gajah          0       0       1    1
Ikan           1       0       0    1
Kucing         1       0       0    1
Merpati        0       1       0    1
Monyet         0       1       0    1
All            2       3       1    6